src/test/resources/find-by-dns.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><FindAllByDnsName xmlns="urn:vim25"><_this type="SearchIndex">ha-searchindex</_this><dnsName>${dnsName}</dnsName><vmSearch>true</vmSearch></FindAllByDnsName></S:Body></S:Envelope>